duxinglang-1/nRF9160_test/E2_V2_TEST/src/lcd/lcd.c
	SpiFlash_Read(databuf, pic_addr, 8);
	w=databuf[2]+256*databuf[3]; 			//获取图片宽度
	h=databuf[4]+256*databuf[5];			//获取图片高度

	pic_addr += 6;

	if((x+w)>LCD_WIDTH)
		show_w = LCD_WIDTH-x;
	else
		show_w = w;
	
	if((y+h)>LCD_HEIGHT)
		show_h = LCD_HEIGHT-y;
	else
		show_h = h;

	if(show_w > LCD_WIDTH)
		show_w = LCD_WIDTH;
	if(show_h > LCD_HEIGHT)
		show_h = LCD_HEIGHT;

	BlockWrite(x,y,show_w,show_h);	//设置刷新位置
	datelen = show_w*(show_h/8+((show_h%8)?1:0));
	if(show_w < w)
		readlen = show_w;
	if(readlen > LCD_DATA_LEN)
		readlen = LCD_DATA_LEN;
	
	while(datelen)
	{
		if(datelen < readlen)
		{
			readlen = datelen;
			datelen = 0;
		}
		else
		{
			readlen = readlen;
			datelen -= readlen;
		}
		
		memset(databuf, 0, COL);
		SpiFlash_Read(databuf, pic_addr, readlen);
		DispData(readlen, databuf);
		
		if(show_w < w)
			pic_addr += w;
		else
			pic_addr += readlen;

		i++;
		if(((y%PAGE_MAX)+i)>3)
			return;
			
		BlockWrite(x,y+i,show_w,show_h);	//设置刷新位置
	}
}
#endif/*LCD_VGM068A4W01_SH1106G||LCD_VGM096064A6W01_SP5090*/

//指定位置显示flash中的图片
//color:图片数据指针
//x:图片显示X坐标
//y:图片显示Y坐标
void LCD_ShowImg_From_Flash(u16_t x, u16_t y, u32_t img_addr)
{
#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
	LCD_dis_img_from_flash(x, y, img_addr);
#else
	LCD_dis_pic_from_flash(x, y, img_addr);
#endif/*LCD_VGM068A4W01_SH1106G||LCD_VGM096064A6W01_SP5090*/
}
#endif/*IMG_FONT_FROM_FLASH*/

#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
//在指定位置显示一个字符
//x,y:起始坐标
//num:要显示的字符:" "--->"~"
void LCD_ShowEn(u16_t x,u16_t y,u8_t num)
{
 	u8_t i,databuf[128] = {0};
	
	num=num-' ';//得到偏移后的值（ASCII字库是从空格开始取模，所以-' '就是对应字符的字库）

	switch(system_font)
	{
	#ifdef FONT_8
		case FONT_SIZE_8:
			BlockWrite(x,y,(system_font/2),1);
			memcpy(databuf, &asc2_SH1106_0804[num][0],(system_font/2));
			DispData((system_font/2), databuf);
			break;
	#endif
	
	#ifdef FONT_16
		case FONT_SIZE_16:
			for(i=0;i<system_font/8;i++)
			{
				BlockWrite(x,y+i,(system_font/2),1);
				memcpy(databuf, &asc2_SH1106_1608[num][(system_font/2)*i],(system_font/2));
				DispData((system_font/2), databuf);
			}
			break;
	#endif

	#ifdef FONT_24
		case FONT_SIZE_24:
			for(i=0;i<system_font/8;i++)
			{
				BlockWrite(x,y+i,(system_font/2),1);
				memcpy(databuf, &asc2_SH1106_2412[num][(system_font/2)*i],(system_font/2));
				DispData((system_font/2), databuf);
			}
			break;
	#endif

	#ifdef FONT_32
		case FONT_SIZE_32:
			for(i=0;i<system_font/8;i++)
			{
				BlockWrite(x,y+i,(system_font/2),1);
				memcpy(databuf, &asc2_SH1106_3216[num][(system_font/2)*i],(system_font/2));
				DispData((system_font/2), databuf);
			}
			break;
	#endif
	}
}

//在指定位置显示一个中文字符
//x,y:起始坐标
//num:要显示的字符:" "--->"~"
void LCD_ShowCn(u16_t x, u16_t y, u16_t num)
{  							  
	u8_t i,databuf[128] = {0};
	u16_t index=0;

	index=94*((num>>8)-0xa0-1)+1*((num&0x00ff)-0xa0-1);			//offset = (94*(区码-1)+(位码-1))*32
	switch(system_font)
	{
	#if 0//def FONT_8
		case FONT_SIZE_8:
			BlockWrite(x,y+i,system_font,1);
			memcpy(databuf, &chinse_SH1106_0808[index][system_font*i],system_font);
			DispData(system_font, databuf);
			break;
	#endif
	
	#if 0//def FONT_16
		case FONT_SIZE_16:
			for(i=0;i<system_font/8;i++)
			{
				BlockWrite(x,y+i,system_font,1);
				memcpy(databuf, &chinse_SH1106_1616[index][system_font*i],system_font);
				DispData(system_font, databuf);
			}
			break;
	#endif

	#if 0//def FONT_24
		case FONT_SIZE_24:
			for(i=0;i<system_font/8;i++)
			{
				BlockWrite(x,y+i,(system_font/2),1);
				memcpy(databuf, &chinse_SH1106_2424[index][system_font*i],system_font);
				DispData(system_font, databuf);
			}
			break;
	#endif

	#if 0//def FONT_32
		case FONT_SIZE_32:
			for(i=0;i<system_font/8;i++)
			{
				BlockWrite(x,y+i,(system_font/2),1);
				memcpy(databuf, &chinse_SH1106_3232[index][system_font*i],system_font);
				DispData(system_font, databuf);
			}
			break;
	#endif
	}
}  
#endif/*LCD_VGM068A4W01_SH1106G||LCD_VGM096064A6W01_SP5090*/

//在指定位置显示一个字符
//x,y:起始坐标
//num:要显示的字符:" "--->"~"
//mode:叠加方式(1)还是非叠加方式(0)
void LCD_ShowChar(uint16_t x,uint16_t y,uint8_t num,uint8_t mode)
{
    u8_t temp,t1,t,i=0;
	u16_t y0=y,x0=x,w=(system_font/2),h=system_font;
	u8_t cbyte=(system_font/2)/8+(((system_font/2)%8)?1:0);		//行扫描，每个字符每一行占用的字节数(英文宽度是字宽的一半)
	u16_t csize=cbyte*system_font;		//得到字体一个字符对应点阵集所占的字节数	
	u8_t fontbuf[256] = {0};	
 	u8_t databuf[2*COL] = {0};

	num=num-' ';//得到偏移后的值（ASCII字库是从空格开始取模，所以-' '就是对应字符的字库）
	switch(system_font)
	{
	#ifdef FONT_16
		case FONT_SIZE_16:
			memcpy(fontbuf, asc2_1608[num], csize);	//调用1608字体
			break;
	#endif
	#ifdef FONT_24
		case FONT_SIZE_24:
			memcpy(fontbuf, asc2_2412[num], csize);	//调用2412字体
			break;
	#endif
	#ifdef FONT_32
		case FONT_SIZE_32:
			memcpy(fontbuf, asc2_3216[num], csize);	//调用3216字体
			break;
	#endif
	#ifdef FONT_48
		case FONT_SIZE_48:
			memcpy(fontbuf, asc2_4824[num], csize);	//调用4824字体
			break;
	#endif
	#ifdef FONT_64
		case FONT_SIZE_64:
			memcpy(fontbuf, asc2_6432[num], csize); //调用6432字体
			break;
	#endif
		default:
			return;							//没有的字库
	}

#ifdef LCD_TYPE_SPI
	if((x+w)>=LCD_WIDTH)
		w = LCD_WIDTH - x;
	if((y+h)>=LCD_HEIGHT)
		h = LCD_HEIGHT - y;
	BlockWrite(x,y,w,h);	//设置刷新位置
#endif
		
	for(t=0;t<csize;t++)
	{
		temp = fontbuf[t];
		for(t1=0;t1<8;t1++)
		{
		#ifdef LCD_TYPE_SPI
			if(temp&0x80)
			{
				databuf[2*i] = POINT_COLOR>>8;
				databuf[2*i+1] = POINT_COLOR;
			}
			else if(mode==0)
			{
				databuf[2*i] = BACK_COLOR>>8;
				databuf[2*i+1] = BACK_COLOR;
			}
			
			temp<<=1;
			i++;
			x++;
			if(x>=LCD_WIDTH)				//超出行区域，直接显示下一行
			{
				DispData(2*i, databuf);
				i=0;

				x=x0;
				y++;
				if(y>=LCD_HEIGHT)return;	//超区域了
				t=t+(cbyte-(t%cbyte))-1;	//获取下一行对应的字节，注意for循环会增加1，所以这里先提前减去1
				break;

			}
			if((x-x0)==(system_font/2))
			{
				DispData(2*i, databuf);
				i=0;
				
				x=x0;
				y++;
				if(y>=LCD_HEIGHT)return;	//超区域了
				break;
			}
		#else
			if(temp&0x80)LCD_Fast_DrawPoint(x,y,POINT_COLOR);
			else if(mode==0)LCD_Fast_DrawPoint(x,y,BACK_COLOR);
			temp<<=1;
			x++;
			if(x>=LCD_WIDTH)				//超出行区域，直接显示下一行
			{
				x=x0;
				y++;
				if(y>=LCD_HEIGHT)return;	//超区域了
				t=t+(cbyte-(t%cbyte))-1;	//获取下一行对应的字节，注意for循环会增加1，所以这里先提前减去1
				break;				
			}
			if((x-x0)==(system_font/2))
			{
				x=x0;
				y++;
				if(y>=LCD_HEIGHT)return; 	//超区域了
				break;
			}
		#endif
		}	
	}  	    	   	 	  
}

//在指定位置显示一个中文字符
//x,y:起始坐标
//num:要显示的字符:" "--->"~"
//mode:叠加方式(1)还是非叠加方式(0)
void LCD_ShowChineseChar(uint16_t x,uint16_t y,uint16_t num,uint8_t mode)
{  							  
	u8_t temp,t1,t,i=0;
	u16_t x0=x,y0=y,w=system_font,h=system_font;
	u16_t index=0;
	u8_t cbyte=system_font/8+((system_font%8)?1:0);				//行扫描，每个字符每一行占用的字节数
	u16_t csize=cbyte*(system_font);								//得到字体一个字符对应点阵集所占的字节数	
	u8_t fontbuf[256] = {0};
	u8_t databuf[2*COL] = {0};

