duxinglang-1/nRF9160_test/E2_V2_TEST/src/lcd/lcd.c
		  #elif defined(FONTMAKER_MBCS_FONT)

		  #else
			LCD_ShowChineseChar_from_flash(x,y,phz,0);
		  #endif
		#else
			LCD_ShowChineseChar(x,y,phz,0);
		#endif
			x+=system_font;
			p+=2;
		}        
	}
}

//显示中英文字符串
//x,y:起点坐标
//*p:字符串起始地址	
void LCD_ShowString(uint16_t x,uint16_t y,uint8_t *p)
{
	u8_t x0=x;
	u16_t width,phz=0;

	while(*p)
	{       
		if(x>=LCD_WIDTH)break;//退出
		if(y>=LCD_HEIGHT)break;//退出
		if(*p<0x80)
		{
		#ifdef IMG_FONT_FROM_FLASH
		  #ifdef FONTMAKER_UNICODE_FONT
		  	width = LCD_Show_Uni_Char_from_flash(x,y,*p,0);
		  	x += width;
		  #elif defined(FONTMAKER_MBCS_FONT)
			width = LCD_Show_Mbcs_Char_from_flash(x,y,*p,0);
		  	x += width;
		  #else
		   #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowEn_from_flash(x,y,*p);
		   #else
			LCD_ShowChar_from_flash(x,y,*p,0);
		   #endif
		  	x += system_font/2;
		  #endif
		#else
		  #ifdef FONTMAKER_MBCS_FONT
			width = LCD_Show_Mbcs_Char(x,y,*p,0);
		  	x += width;
		  #else
		   #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowEn(x,y,*p);
		   #else
			LCD_ShowChar(x,y,*p,0);
		   #endif
		  	x += system_font/2;
		  #endif
		#endif
			
			p++;
		}
		else if(*(p+1))
		{
			phz = *p<<8;
			phz += *(p+1);
		#ifdef IMG_FONT_FROM_FLASH
		  #ifdef FONTMAKER_UNICODE_FONT
		  
		  #elif defined(FONTMAKER_MBCS_FONT)
			LCD_Show_Mbcs_CJK_Char_from_flash(x,y,phz,0);
		  #else
		   #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowCn_from_flash(x,y,phz);
		   #else
			LCD_ShowChineseChar_from_flash(x,y,phz,0);
		   #endif
		  #endif
		#else
		  #if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
			LCD_ShowCn(x,y,phz);
		  #else
			LCD_ShowChineseChar(x,y,phz,0);
		  #endif
		#endif
			x+=system_font;
			p+=2;
		}        
	}
}

#ifdef FONTMAKER_UNICODE_FONT
void LCD_ShowUniStringInRect(u16_t x, u16_t y, u16_t width, u16_t height, u16_t *p)
{
	u8_t x0=x;
	u16_t w,end=0x000a;
	
	width+=x;
	height+=y;
	while(*p)
	{       
		if(x>=width){x=x0;y+=system_font;}
		if(*p==end){x=x0;y+=system_font;p++;}
		if(y>=height)break;//退出
		if(*p==0x0000)break;//退出

		w = LCD_Show_Uni_Char_from_flash(x,y,*p,0);
		x += w;
		p++;
	}
}

//显示中英文字符串
//x,y:起点坐标
//*p:字符串起始地址	
void LCD_ShowUniString(u16_t x, u16_t y, u16_t *p)
{
	uint8_t x0=x;
	uint8_t width;

	while(*p)
	{       
		if(x>=LCD_WIDTH)break;//退出
		if(y>=LCD_HEIGHT)break;//退出

		width = LCD_Show_Uni_Char_from_flash(x,y,*p,0);
		x += width;
		p++;
	}
}
#endif/*FONTMAKER_UNICODE_FONT*/

//m^n函数
//返回值:m^n次方.
uint32_t LCD_Pow(uint8_t m,uint8_t n)
{
	uint32_t result=1;	 
	while(n--)result*=m;    
	return result;
}

//显示数字,高位为0,则不显示
//x,y :起点坐标	 
//len :数字的位数
//color:颜色 
//num:数值(0~4294967295);	 
void LCD_ShowNum(uint16_t x,uint16_t y,uint32_t num,uint8_t len)
{         	
	uint8_t t,temp;
	uint8_t enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
			#ifdef IMG_FONT_FROM_FLASH
				LCD_ShowChar_from_flash(x+(system_font/2)*t,y,' ',0);
			#else
				LCD_ShowChar(x+(system_font/2)*t,y,' ',0);
			#endif
				continue;
			}
			else 
				enshow=1; 
		 	 
		}
	#ifdef IMG_FONT_FROM_FLASH
		LCD_ShowChar_from_flash(x+(system_font/2)*t,y,temp+'0',0);
	#else
	 	LCD_ShowChar(x+(system_font/2)*t,y,temp+'0',0); 
	#endif
	}
}

//显示数字,高位为0,还是显示
//x,y:起点坐标
//num:数值(0~999999999);	 
//len:长度(即要显示的位数)
//mode:
//[7]:0,不填充;1,填充0.
//[6:1]:保留
//[0]:0,非叠加显示;1,叠加显示.
void LCD_ShowxNum(uint16_t x,uint16_t y,uint32_t num,uint8_t len,uint8_t mode)
{  
	uint8_t t,temp;
	uint8_t enshow=0;						   
	for(t=0;t<len;t++)
	{
		temp=(num/LCD_Pow(10,len-t-1))%10;
		if(enshow==0&&t<(len-1))
		{
			if(temp==0)
			{
				if(mode&0X80)
				{
				#ifdef IMG_FONT_FROM_FLASH
					LCD_ShowChar_from_flash(x+(system_font/2)*t,y,'0',mode&0X01);
				#else
					LCD_ShowChar(x+(system_font/2)*t,y,'0',mode&0X01);
				#endif
				}
				else 
				{
				#ifdef IMG_FONT_FROM_FLASH
					LCD_ShowChar_from_flash(x+(system_font/2)*t,y,' ',mode&0X01);
				#else
					LCD_ShowChar(x+(system_font/2)*t,y,' ',mode&0X01); 
				#endif
				}
				
 				continue;
			}
			else 
				enshow=1; 
		}
	#ifdef IMG_FONT_FROM_FLASH
		LCD_ShowChar_from_flash(x+(system_font/2)*t,y,temp+'0',mode&0X01);
	#else
	 	LCD_ShowChar(x+(system_font/2)*t,y,temp+'0',mode&0X01);
	#endif
	}
} 

#ifdef FONTMAKER_UNICODE_FONT
//根据字体测量字符的宽度
//word:unicode字符
u8_t LCD_Measure_Uni_Byte(u16_t word)
{
	u8_t width,*ptr_font;
	u8_t fontbuf[4] = {0};	
	u32_t i,index_addr,font_addr=0;

#ifdef IMG_FONT_FROM_FLASH
	switch(system_font)
	{
	#ifdef FONT_16
		case FONT_SIZE_16:
			font_addr = FONT_EN_UNI_16_ADDR;
			break;
	#endif
	#ifdef FONT_20
		case FONT_SIZE_20:
			font_addr = FONT_EN_UNI_20_ADDR;
			break;
	#endif
	#ifdef FONT_28
		case FONT_SIZE_28:
			font_addr = FONT_EN_UNI_28_ADDR;
			break;
	#endif
	#ifdef FONT_36
		case FONT_SIZE_36:
			font_addr = FONT_EN_UNI_36_ADDR;
			break;
	#endif
	#ifdef FONT_52
		case FONT_SIZE_52:
			font_addr = FONT_EN_UNI_52_ADDR;
			break;
	#endif
	#ifdef FONT_68
		case FONT_SIZE_68:
			font_addr = FONT_EN_UNI_68_ADDR;
			break;
	#endif
	
		default:
			return;
	}

	//read head data
	SpiFlash_Read((u8_t*)&uni_infor.head, font_addr, FONT_UNI_HEAD_LEN);
	if((uni_infor.head.id[0] != FONT_UNI_HEAD_FLAG_0)
		||(uni_infor.head.id[1] != FONT_UNI_HEAD_FLAG_1)
		||(uni_infor.head.id[2] != FONT_UNI_HEAD_FLAG_2))
	{
		return;
	}
	
	//read sect data
	SpiFlash_Read((u8_t*)&uni_infor.sect, font_addr+FONT_UNI_HEAD_LEN, uni_infor.head.sect_num*FONT_UNI_SECT_LEN);
	
	//read index data
	for(i=0;i<uni_infor.head.sect_num;i++)
	{
		if((word>=uni_infor.sect[i].first_char)&&((word<=uni_infor.sect[i].last_char)))
		{
			index_addr = (word-uni_infor.sect[i].first_char)*4+uni_infor.sect[i].index_addr;
			break;
		}
	}
	
	SpiFlash_Read(fontbuf, font_addr+index_addr, 4);
	width = fontbuf[3]>>2;
#else
	switch(system_font)
	{
	#ifdef FONT_16
		case FONT_SIZE_16:
			ptr_font=uni_16_rm; 	 	//调用1608字体
			break;
	#endif
	#ifdef FONT_24
		case FONT_SIZE_24:
			ptr_font=uni_24_rm;			//调用2412字体
			break;
	#endif
	#ifdef FONT_32
		case FONT_SIZE_32:
			ptr_font=uni_32_rm;			//调用3216字体
			break;
	#endif
		default:
			return 0;							//没有的字库
	}

