duxinglang-1/nRF9160_test/E2_V2_TEST/src/lcd/lcd.c
	//read head data
	memcpy((u8_t*)&uni_infor.head, ptr_font, FONT_UNI_HEAD_LEN);
	if((uni_infor.head.id[0] != FONT_UNI_HEAD_FLAG_0)
		||(uni_infor.head.id[1] != FONT_UNI_HEAD_FLAG_1)
		||(uni_infor.head.id[2] != FONT_UNI_HEAD_FLAG_2))
	{
		return;
	}
	
	//read sect data
	memcpy((u8_t*)&uni_infor.sect, ptr_font[FONT_UNI_HEAD_LEN], uni_infor.head.sect_num*FONT_UNI_SECT_LEN);
	
	//read index data
	for(i=0;i<uni_infor.head.sect_num;i++)
	{
		if((word>=uni_infor.sect[i].first_char)&&((word<=uni_infor.sect[i].last_char)))
		{
			index_addr = (word-uni_infor.sect[i].first_char)*4+uni_infor.sect[i].index_addr;
			break;
		}
	}
	
	width = ptr_font[index_addr+3]>>2;
#endif

	return width;
}

//根据字体测量字符串的长度和高度
//p:字符串指针
//width,height:返回的字符串宽度和高度变量地址
void LCD_MeasureUniString(uint16_t *p, uint16_t *width, uint16_t *height)
{
	uint8_t font_size;

	*width = 0;
	*height = 0;

	if(p == NULL)
		return;

	(*height) = system_font;

	while(*p)
	{
		(*width) += LCD_Measure_Uni_Byte(*p);
		p++;
	}  
}

#elif defined(FONTMAKER_MBCS_FONT)
//根据字体测量字符的宽度
//byte:字符
u8_t LCD_Measure_Mbcs_Byte(u8_t byte)
{
	u8_t width,*ptr_font;
	u8_t fontbuf[4] = {0};	
	u32_t index_addr,font_addr=0;

#ifdef IMG_FONT_FROM_FLASH
	switch(system_font)
	{
	#ifdef FONT_16
		case FONT_SIZE_16:
			font_addr = FONT_RM_ASC_16_ADDR;
			break;
	#endif
	#ifdef FONT_24
		case FONT_SIZE_24:
			font_addr = FONT_RM_ASC_24_ADDR;
			break;
	#endif
	#ifdef FONT_32
		case FONT_SIZE_32:
			font_addr = FONT_RM_ASC_32_ADDR;
			break;
	#endif
		default:
			return;
	}

	index_addr = FONT_MBCS_HEAD_LEN+4*byte;
	SpiFlash_Read(fontbuf, font_addr+index_addr, 4);
	width = fontbuf[3]>>2;
#else
	switch(system_font)
	{
	#ifdef FONT_16
		case FONT_SIZE_16:
			ptr_font=asc2_16_rm; 	 	//调用1608字体
			break;
	#endif
	#ifdef FONT_24
		case FONT_SIZE_24:
			ptr_font=asc2_24_rm;			//调用2412字体
			break;
	#endif
	#ifdef FONT_32
		case FONT_SIZE_32:
			ptr_font=asc2_32_rm;			//调用3216字体
			break;
	#endif
		default:
			return 0;							//没有的字库
	}
	
	index_addr = FONT_MBCS_HEAD_LEN+4*byte;
	width = ptr_font[index_addr+3]>>2;
#endif

	return width;
}
#endif

//根据字体测量字符串的长度和高度
//p:字符串指针
//width,height:返回的字符串宽度和高度变量地址
void LCD_MeasureString(uint8_t *p, uint16_t *width,uint16_t *height)
{
	uint8_t font_size;

	*width = 0;
	*height = 0;

	if(p == NULL || strlen((const char *)p) == 0)
		return;

	(*height) = system_font;

	while(*p)
	{
		if(*p<0x80)
		{
		#ifdef FONTMAKER_UNICODE_FONT
			(*width) += LCD_Measure_Uni_Byte(*p);
		#elif defined(FONTMAKER_MBCS_FONT)
			(*width) += LCD_Measure_Mbcs_Byte(*p);
		#else
			(*width) += system_font/2;
		#endif
			p++;
		}
		else if(*(p+1))
		{
			(*width) += system_font;
			p += 2;
		}        
	}  
}

//恢复字体画笔默认颜色
void LCD_ReSetFontColor(void)
{
	POINT_COLOR = WHITE;
}

//设置字体画笔颜色
void LCD_SetFontColor(u16_t color)
{
	POINT_COLOR = color;
}

//恢复字体背景默认颜色
void LCD_ReSetFontBgColor(void)
{
	BACK_COLOR = BLACK;
}

//设置字体背景颜色
void LCD_SetFontBgColor(u16_t color)
{
	BACK_COLOR = color;
}

//设置系统字体
//font_size:枚举字体大小
void LCD_SetFontSize(uint8_t font_size)
{
	if(font_size > FONT_SIZE_MIN && font_size < FONT_SIZE_MAX)
		system_font = font_size;
}

void LCDMsgProcess(void)
{
	if(lcd_sleep_in)
	{
		lcd_sleep_in = false;
		
		if(LCD_Get_BL_Mode() != LCD_BL_AUTO)
			return;
		
		LCD_BL_Off();
		LCD_SleepIn();
	}

	if(lcd_sleep_out)
	{	
		lcd_sleep_out = false;
		
		if(LCD_Get_BL_Mode() != LCD_BL_AUTO)
			return;
		
		LCD_SleepOut();
		pmu_battery_update();
		if(IsInIdleScreen())
		{
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_TIME|SCREEN_EVENT_UPDATE_DATE|SCREEN_EVENT_UPDATE_WEEK|SCREEN_EVENT_UPDATE_SIG|SCREEN_EVENT_UPDATE_NET_MODE|SCREEN_EVENT_UPDATE_BAT;
			IdleScreenProcess();
		}
		
		LCD_BL_On();
	}
}
